/**
 * @file   tetris.h
 * @brief  tetris・外部公開定義
 */

#ifndef __TETRIS_H__
#define __TETRIS_H__

//======================================================
// インクルード
//======================================================
#include "button.h"
#include "analogStick.h"

//======================================================
// マクロ定義
//======================================================

//======================================================
// 型定義
//======================================================
/**
 * @brief テトリス入力パラメータ構造体
 * @note main.cで物理ボタンとの割り当てを行うため公開している
 */
typedef struct
{
    BUTTON_class_t turnR_button;      /**< 右回転ボタン */
    BUTTON_class_t turnL_button;      /**< 左回転ボタン */
    BUTTON_class_t control_button1;   /**< コントロールボタン1 */
    BUTTON_class_t control_button2;   /**< コントロールボタン2 */
    ANALOGSTICK_class_t analog_stick; /**< アナログスティック */
} TETRIS_input_parameter_t;

//======================================================
// グローバル変数・定数extern宣言
//======================================================

//======================================================
// グローバル関数extern宣言
//======================================================
/* main */
extern void TETRIS_main(TETRIS_input_parameter_t *input_parameter);

#endif /* __TETRIS_H__ */