/**
 * @file   timer_internal.h
 * @brief  TIMERコンポーネント・内部公開定義
 */

#ifndef __TIMER_INIT_H__
#define __TIMER_INIT_H__

//======================================================
// インクルード
//======================================================

//======================================================
// マクロ定義
//======================================================

//======================================================
// 型定義
//======================================================

//======================================================
// グローバル変数・定数extern宣言
//======================================================

//======================================================
// グローバル関数extern宣言
//======================================================
/* init → ops */
extern void timer_alarm0_interrupt_callback();
extern void timer_alarm1_interrupt_callback();
extern void timer_alarm2_interrupt_callback();
extern void timer_alarm3_interrupt_callback();

#endif /* __TIMER_INIT_H__ */