/**
 * @file   adc_ctrl.c
 * @brief  ADCコンポーネント・ADC汎用制御実装
 */

//======================================================
// インクルード
//======================================================
#include "adc.h"
#include "adc_internal.h"
#include "typedef.h"

//======================================================
// マクロ定義
//======================================================

//======================================================
// 型定義
//======================================================

//======================================================
// 変数・定数
//======================================================

//======================================================
// プロトタイプ宣言
//======================================================

//======================================================
// 公開関数定義
//======================================================
/**
 * @brief  AD単発変換の実行
 * @details AD変換実行要求 → AD値の読み取りを行う 
 *          指定チャネルが単発変換モードに設定されている場合のみ利用可能
 *          =指定チャネルが単発モードでない場合は無効値を返す
 * @param  select_ch ADCチャネル（ch0-ch4）
 * @return uint16_t AD変換結果（0-4095）、もしくはエラー/無効時は 0xFFFF を返す
 */
uint16_t ADC_get_oneshot_ad(ADC_ch_t select_ch)
{
    // 指定チャネルのモードが単発に設定されてない場合は処理を実行せず無効値を返す
    if (single_conv != adc_read_conv_mode(select_ch))
    {
        return 0xFFFF;
    }

    // ch指定＆変換実行
    ADC_select_ainsel(select_ch);
    ADC_start_oneshot();
    while (!adc_check_is_adc_ready())
    {
        // 変換完了待ち
    }

    // AD値を読み出して返す
    return ADC_read_result();
}

//======================================================
// 内部関数定義
//======================================================