/**
 * @file   analogStick_init.c
 * @brief  アナログスティックコンポーネント・初期化実装
 */

//======================================================
// インクルード
//======================================================
#include "analogStick.h"
#include "analogStick_internal.h"

//======================================================
// マクロ定義
//======================================================

//======================================================
// 型定義
//======================================================

//======================================================
// 変数・定数
//======================================================

//======================================================
// プロトタイプ宣言
//======================================================

//======================================================
// 公開関数定義
//======================================================
/**
 * @brief アナログスティック初期化
 * @details config値を元にアナログスティックのインスタンスを生成する
 * @param config 初期化設定
 * @return 生成したアナログスティックのインスタンス
 */
ANALOGSTICK_class_t ANALOGSTICK_initialize_instance(ANALOGSTICK_config_t config)
{
    ANALOGSTICK_class_t analogStick_instance;

    // config値のコピー
    analogStick_instance.config = config;

    // 内部ステートの初期値設定
    analogStick_instance.x_ad_value = 0;
    analogStick_instance.y_ad_value = 0;
    analogStick_instance.x_coordinate_value = 0;
    analogStick_instance.y_coordinate_value = 0;

    return analogStick_instance;
}

//======================================================
// 内部関数定義
//======================================================