/**
 * @file   gpio_internal.h
 * @brief  GPIOコンポーネント・内部公開定義
 */

#ifndef __GPIO_INTERNAL_H__
#define __GPIO_INTERNAL_H__

//======================================================
// インクルード
//======================================================
#include "gpio.h"

//======================================================
// マクロ定義
//======================================================

//======================================================
// 型定義
//======================================================

//======================================================
// グローバル変数・定数extern宣言
//======================================================

//======================================================
// グローバル関数extern宣言
//======================================================
/* init → ops */
extern void gpio_select_function(GPIO_num_t gpio_num, GPIO_function_num_t func_num);
extern void gpio_set_direction(GPIO_num_t gpio_num, GPIO_io_direction_t direction);

#endif /* __GPIO_INTERNAL_H__ */