/**
 * @file   math_lib.c
 * @brief  算術演算汎用ライブラリ実装
 */

//======================================================
// インクルード
//======================================================
#include "math_lib.h"

//======================================================
// マクロ定義
//======================================================

//======================================================
// 型定義
//======================================================

//======================================================
// 変数・定数
//======================================================

//======================================================
// プロトタイプ宣言
//======================================================

//======================================================
// 公開関数定義
//======================================================
/**
 * @brief 整数値の10進桁分解
 * @details 上位桁から順に配列へ格納する
 * @param array_dst 分解結果格納先配列
 * @param num 分解対象整数値
 * @return 分解後の桁数
 */
int MATH_split_digits(int array_dst[], int num)
{
    if (num == 0)
    {
        array_dst[0] = 0;
        return 1;
    }
    int temp = num;
    int digits = 0;
    while (temp > 0)
    {
        temp /= 10;
        digits++;
    }

    int div = 1;
    for (int i = 1; i < digits; ++i)
        div *= 10;

    for (int k = 0; k < digits; ++k)
    {
        array_dst[k] = (num / div) % 10;
        div /= 10;
    }

    return digits;
}

/**
 * @brief 非負剰余値算出
 * @details 被除数が負の場合は除数を加算して非負範囲へ補正する
 *          C言語の剰余演算は被除数が負の場合に負の値を返すため、非負剰余値が必要な場合は本関数を使用する
 *          0~Nの整数ループ等に使う（ステート制御等）
 * @param dividend 被除数
 * @param divisor 除数
 * @return 演算結果剰余値
 */
int MATH_modulo(int dividend, int divisor)
{
    if (dividend >= 0)
    {
        return dividend % divisor;
    }
    else
    {
        while (dividend < 0)
            dividend += divisor;

        return dividend;
    }
}