/**
 * @file   button_ops.c
 * @brief  ボタンコンポーネント・汎用制御実装
 */

//======================================================
// インクルード
//======================================================
#include "button.h"
#include "button_internal.h"

//======================================================
// マクロ定義
//======================================================

//======================================================
// 型定義
//======================================================

//======================================================
// 変数・定数
//======================================================

//======================================================
// プロトタイプ宣言
//======================================================

//======================================================
// 公開関数定義
//======================================================
/**
 * @brief ボタン押下エッジ判定
 * @details ボタンを押下した瞬間を検出する = 押下直後の初回コール時のみtrueを返す
 *          初回コール以降もボタンを押下し続けた場合はfalseを返す
 * @param button ボタンのインスタンス
 * @return 押下検出時true、未検出時false
 */
bool BUTTON_check_pushed_once(BUTTON_class_t *button)
{
    if (button->state_push) // 直前までボタン押下あり
    {
        if (GPIO_get_input(button->config.assign_gpioPin)) // ボタン押下あり
        {
            return false;
        }
        else // ボタン押下なし
        {
            button->state_push = false;
            return false;
        }
    }
    else // 直前までボタン押下なし
    {
        if (GPIO_get_input(button->config.assign_gpioPin)) // ボタン押下あり
        {
            button->state_push = true;
            return true;
        }
        else // ボタン押下なし
        {
            return false;
        }
    }
}

/**
 * @brief ボタン押下状態判定
 * @details ボタンの現在の押下状態を返す = 押下している間はtrue、非押下時はfalseを返す
 * @param button ボタンのインスタンス
 * @return 押下中true、非押下時false
 */
bool BUTTON_check_pushed_state(BUTTON_class_t *button)
{
    return GPIO_get_input(button->config.assign_gpioPin);
}

//======================================================
// 内部関数定義
//======================================================