/**
 * @file   interrupt_init.c
 * @brief  割り込みコンポーネント・初期化実装
 */

//======================================================
// インクルード
//======================================================
#include "interrupt.h"
#include "interrupt_internal.h"

//======================================================
// マクロ定義
//======================================================

//======================================================
// 型定義
//======================================================

//======================================================
// 変数・定数
//======================================================

//======================================================
// プロトタイプ宣言
//======================================================

//======================================================
// 公開関数定義
//======================================================
/**
 * @brief  割り込み機能初期化
 * @details ベクタテーブルをROMからRAMへコピーし、割り込みハンドラ割り当て後にVTORをRAM側へ切り替える
 * @return なし
 * @note 各ペリフェラル側の割り込み有効化、コールバック関数設定、IRQn有効化は本関数外で実施する
 */
void INTERRUPT_initialize()
{
    interrupt_copy_vector_table_to_ram(); // ベクタテーブル初期化 (ROM → RAMへコピー)
    interrupt_set_IRQ_handler();          // ベクタテーブル（RAM）に割り込みハンドラのポインタを設定
    interrupt_set_vtor();                 // ベクタテーブル オフセットアドレス設定
}

//======================================================
// 内部関数定義
//======================================================